vestaCases/Top_Ref/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       true;

mergeTolerance 1e-6;

// Geometry. Definition of all surfaces. All surfaces are of class
// searchableSurface.
// Surfaces are used
// - to specify refinement for any mesh cell intersecting it
// - to specify refinement for any mesh cell inside/outside/near
// - to 'snap' the mesh boundary to the surface
geometry
{

	spoiler.obj
	{
		type triSurfaceMesh;
		name spoiler;
	}

	spoiler_refinement //defines spoiler
	{ 
	  type searchableBox;
	  min (-3 -3.5 -25.7);
	  max (5 6.5 -8.7);
	}

	building_front_edge_refinement
	{ 
	  type searchableBox;
	  min (-5 -14.32 -131);
	  max (20 8 131);
	}

};

// Settings for the castellatedMesh generation.
castellatedMesh true;
snap true;
addLayers true;

castellatedMeshControls
{
	maxLocalCells 5000000;
    	maxGlobalCells 40000000;
    	minRefinementCells 30;
    	nCellsBetweenLevels 2;
	resolveFeatureAngle 30;
   	 features
   	 (
       	  {
		file "spoiler.eMesh";
		level 3;
      	  }

	);
	// Surface based refinement
    	// ~~~~~~~~~~~~~~~~~~~~~~~~
	
  	  // Specifies two levels for every surface. The first is the minimum level,
  	 // every cell intersecting a surface gets refined up to the minimum level.
   	 // The second level is the maximum level. Cells that 'see' multiple
  	  // intersections where the intersections make an
   	 // angle > resolveFeatureAngle get refined up to the maximum level.

    	refinementSurfaces
  	  {
        building
      	  {
            // Surface-wise min and max refinement level. 
            level (3 3);
           }
        spoiler
      	  {
            // Surface-wise min and max refinement level.
            level (3 3);
           }

	  }

	refinementRegions
  	  {
		spoiler_refinement
		{
			mode inside;
			levels ((1e15 2));
		}
		building_front_edge_refinement
		{
			mode inside;
			levels ((1e15 1));
		}

          }
	resolveFeatureAngle 30;
	planarAngle 30;
	allowFreeStandingZoneFaces true;
	locationInMesh (0 60 30);
}


  

// Settings for the snapping.
snapControls
{
	// Reommendations from meshing of NACA tutorial from Wolf Dynamics
	nSmoothPatch 10;
	tolerance 1.0;
	nSolveIter 100;
	nRelaxIter 10;
	nFeatureSnapIter 100;


};

addLayersControls
{
	relativeSizes true;

  	  layers
  	  {
    	
     	   building
		{nSurfaceLayers 15;}

	   ground 
		{nSurfaceLayers 15;}

	   spoiler
		{nSurfaceLayers 15;}

	  }
     
   

    expansionRatio 1.15;
    finalLayerThickness 0.4;
    minThickness 0.15;
    nGrow 1;

    featureAngle 170; 
    nRelaxIter 20;
    nSmoothSurfaceNormals 3; //was 1
    nSmoothNormals 1;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.6; //was .3
    minMedianAxisAngle 130;
    nBufferCellsNoExtrude 0;
    nLayerIter 80;
    minMedialAxisAngle 80;
    slipFeatureAngle 30; //only here now

    // Extra Controls
	concaveAngle 30;
	mergePatchFacesAngle 60;
	layerTerminationAngle -180;

};

meshQualityControls
{
    maxNonOrtho 75;
    maxBoundarySkewness 4;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-13;
    minTetQuality -1e+30;
    minArea -1e-1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.05;
    minVolRatio 0.01;
    minTriangleTwist -1;

    // Advanced: limit maximum cells with bad quality
    nSmoothScale 4;
    errorReduction 0.75;
};

